Podkova/src/Enums/ВариантыОтраженияКорректировокПоступлений/ВариантыОтраженияКорректировокПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОтраженияКорректировокПоступлений</name>
  <enumValues>
    <name>ОтразитьНаПрочихДоходах</name>
  </enumValues>
  <enumValues>
    <name>СписатьНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУвеличитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьСтоимостьТовара</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУменьшитьСкладскиеОстатки</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУчестьПриИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьСтоимостьТовара</name>
  </enumValues>
  <enumValues>
    <name>УвеличитьЗакупкуУвеличитьТоварыУПартнеров</name>
  </enumValues>
  <enumValues>
    <name>УменьшитьЗакупкуУменьшитьТоварыУПартнеров</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/ВариантыОтраженияКорректировокПоступлений/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУвеличитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУчестьПриИнвентаризации) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУменьшитьСкладскиеОстатки) <> Неопределено Тогда
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстПояснения = ТекстПояснения + НСтр("ru='Выберите вариант отражения расхождений:'");
	
КонецПроцедуры

#КонецОбласти
